const Model = require("../models/subdistrict");
const asyncHandler = require("../middleware/asyncHandler");
const customResponse = require("../utils/customResponse");

exports.getAllModel = asyncHandler(async (req, res, next) => {
  try {
    const allUser = await Model.find();
    const total = await Model.countDocuments();
    res.status(200).json({
      success: true,
      count: total,
      data: allUser,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});

exports.createModel = asyncHandler(async (req, res, next) => {
  try {
    const { horoo } = req.body;
    const result = await Model.create({
      ...req.body,
    });
    res.status(200).json({
      success: true,
      data: result,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});

exports.generateSum = asyncHandler(async (req, res, next) => {
  try {
    const sumuud = [
      //arkhngai
      {
        aimag: "66cd21ae7025aeb24b021b58",
        sum: [
          "Батцэнгэл",
          "Булган",
          "Жаргалант",
          "Ихтамир",
          "Өгийнуур",
          "Өлзийт",
          "Өндөр-Улаан",
          "Тариат",
          "Төвшрүүлэх",
          "Хайрхан",
          "Хангай",
          "Хашаат",
          "Хотонт",
          "Цахир",
          "Цэнхэр",
          "Цэцэрлэг",
          "Чулуут",
          "Эрдэнэбулган",
          "Эрдэнэмандал",
        ],
      },
      // bayn ulgi
      {
        aimag: "66cd21c37025aeb24b021b5a",
        sum: [
          "Алтай",
          "Алтанцөгц",
          "Баяннуур",
          "Бугат",
          "Булган",
          "Буянт",
          "Дэлүүн",
          "Ногооннуур",
          "Сагсай",
          "Толбо",
          "Улаанхус",
          "Цагааннуур",
          "Цэнгэл",
          "Өлгий",
        ],
      },
      //Баянхонгор аймаг
      {
        aimag: "66cd21cf7025aeb24b021b5c",
        sum: [
          "Баацагаан",
          "Баянбулаг",
          "Баянговь",
          "Баянлиг",
          "Баян-Овоо",
          "Баян-Өндөр",
          "Баянхонгор",
          "Баянцагаан",
          "Богд",
          "Бөмбөгөр",
          "Бууцагаан",
          "Галуут",
          "Гурванбулаг",
          "Жаргалант",
          "Жинст",
          "Заг",
          "Өлзийт",
          "Хүрээмарал",
          "Шинэжинст",
          "Эрдэнэцогт",
        ],
      },
      //bulgn
      {
        aimag: "66cd21db7025aeb24b021b5e",
        sum: [
          "Булган",
          "Баян-Агт",
          "Баяннуур",
          "Бугат",
          "Бүрэгхангай",
          "Гурванбулаг",
          "Дашинчилэн",
          "Могод",
          "Орхон",
          "Рашаант",
          "Сайхан",
          "Сэлэнгэ",
          "Тэшиг",
          "Хангал",
          "Хишиг-Өндөр",
          "Хутаг-Өндөр",
        ],
      },
      //govi altai
      {
        aimag: "66cd21e87025aeb24b021b60",
        sum: [
          "Алтай",
          "Баян-Уул",
          "Бигэр",
          "Бугат",
          "Дарви",
          "Дэлгэр",
          "Жаргалан",
          "Есөнбулаг",
          "Тайшир",
          "Тонхил",
          "Төгрөг",
          "Халиун",
          "Хөхморьт",
          "Цогт",
          "Цээл",
          "Чандмань",
          "Шарга",
          "Эрдэнэ",
        ],
      },
      //Говьсүмбэр аймаг
      {
        aimag: "66cd227f7025aeb24b021b80",
        sum: ["Сүмбэр", "Баянтал", "Шивээговь", "Чойр"],
      },
      //darkhan аймаг
      {
        aimag: "66cd226d7025aeb24b021b7c",
        sum: ["Дархан", "Орхон", "Хонгор", "Шарын гол"],
      },
      // Дорноговь аймаг
      {
        aimag: "66cd21f87025aeb24b021b62",
        sum: [
          "Айраг",
          "Алтанширээ",
          "Даланжаргалан",
          "Дэлгэрэх",
          "Замын-Үүд",
          "Иххэт",
          "Мандах",
          "Сайншанд",
          "Өргөн",
          "Сайхандулаан",
          "Улаанбадрах",
          "Хатанбулаг",
          "Хөвсгөл",
          "Эрдэнэ",
        ],
      },
      //Дорнод аймаг
      {
        aimag: "66cd21fe7025aeb24b021b64",
        sum: [
          "Баяндун",
          "Баянтүмэн",
          "Баян-Уул",
          "Булган",
          "Гурванзагал",
          "Дашбалбар",
          "Матад",
          "Сэргэлэн",
          "Халхгол",
          "Хөлөнбуйр",
          "Хэрлэн",
          "Цагаан-Овоо",
          "Чойбалсан",
          "Чулуунхороот",
        ],
      },
      //ундговь аймаг
      {
        aimag: "66cd22087025aeb24b021b66",
        sum: [
          "Адаацаг",
          "Баянжаргалан",
          "Говь-Угтаал",
          "Гурвансайхан",
          "Дэлгэрхангай",
          "Дэлгэрцогт",
          "Дэрэн",
          "Луус",
          "Өлзийт",
          "Өндөршил",
          "Сайнцагаан",
          "Мандал говь",
          "Сайхан-Овоо",
          "Хулд",
          "Цагаандэлгэр",
          "Эрдэнэдалай",
        ],
      },
      //Завхан аймаг
      {
        aimag: "66cd22157025aeb24b021b68",
        sum: [
          "Алдархаан",
          "Асгат",
          "Баянтэс",
          "Баянхайрхан",
          "Дөрвөлжин",
          "Завханмандал",
          "Идэр",
          "Их-Уул",
          "Нөмрөг",
          "Отгон",
          "Сантмаргаз",
          "Сонгино",
          "Тосонцэнгэл",
          "Түдэвтэй",
          "Тэлмэн",
          "Тэс",
          "Ургамал",
          "Улиастай",
          "Цагаанхайрхан",
          "Цагаанчулуут",
          "Цэцэн-Уул",
          "Шилүүстэй",
          "Эрдэнэхайрхан",
          "Яруу",
        ],
      },
      // Орхон аймаг
      {
        aimag: "66cd22747025aeb24b021b7e",
        sum: ["Баян-Өндөр", "Жаргалант", "Эрдэнэт"],
      },
      //Өвөрхангай аймаг
      {
        aimag: "66cd22217025aeb24b021b6a",
        sum: [
          "Арвайхээр",
          "Баруунбаян-Улаан",
          "Бат-Өлзий",
          "Баянгол",
          "Баян-Өндөр",
          "Богд",
          "Бүрд",
          "Гучин-Ус",
          "Есөнзүйл",
          "Зүүнбаян-Улаан",
          "Нарийнтээл",
          "Өлзийт",
          "Сант",
          "Тарагт",
          "Төгрөг",
          "Уянга",
          "Хайрхандулаан",
          "Хархорин",
          "Хужирт",
        ],
      },
      //Өмнөговь аймаг
      {
        aimag: "66cd222d7025aeb24b021b6c",
        sum: [
          "Даланзадгад",
          "Баяндалай",
          "Баян-Овоо",
          "Булган",
          "Гурвантэс",
          "Мандал-Овоо",
          "Манлай",
          "Ноён",
          "Номгон",
          "Сэврэй",
          "Ханбогд",
          "Ханхонгор",
          "Хүрмэн",
          "Цогт-Овоо",
          "Цогтцэций",
        ],
      },
      //Сүхбаатар аймаг
      {
        aimag: "66cd22347025aeb24b021b6e",
        sum: [
          "Баруун урт",
          "Асгат",
          "Баяндэлгэр",
          "Дарьганга",
          "Мөнххаан",
          "Наран",
          "Онгон",
          "Сүхбаатар",
          "Түвшинширээ",
          "Түмэнцогт",
          "Уулбаян",
          "Халзан",
          "Эрдэнэцагаан",
        ],
      },
      //. Сэлэнгэ аймаг
      {
        aimag: "66cd223d7025aeb24b021b70",
        sum: [
          "Сүхбаатар",
          "Алтанбулаг",
          "Баруунбүрэн",
          "Баянгол",
          "Ерөө",
          "Жавхлант",
          "Зүүнбүрэн",
          "Мандал",
          "Орхон",
          "Орхонтуул",
          "Сайхан",
          "Сант",
          "Түшиг",
          "Хушаат",
          "Хүдэр",
          "Цагааннуур",
          "Шаамар",
        ],
      },
      //.  Төв аймаг
      {
        aimag: "66cd22477025aeb24b021b72",
        sum: [
          "Алтанбулаг",
          "Аргалант",
          "Архуст",
          "Батсүмбэр",
          "Баян",
          "Баяндэлгэр",
          "Баянжаргалан",
          "Баян-Өнжүүл",
          "Баянхангай",
          "Баянцагаан",
          "Баянцогт",
          "Баянчандмань",
          "Борнуур",
          "Бүрэн",
          "Дэлгэрхаан",
          "Жаргалант",
          "Заамар",
          "Зуунмод",
          "Лүн",
          "Мөнгөнморьт",
          "Өндөрширээт",
          "Сүмбэр",
          "Сэргэлэн",
          "Угтаалцайдам",
          "Цээл",
          "Эрдэнэ",
          "Эрдэнэсант",
        ],
      },
      //Увс аймаг
      {
        aimag: "66cd224d7025aeb24b021b74",
        sum: [
          "Улаангом",
          "Баруунтуруун",
          "Бөхмөрөн",
          "Давст",
          "Завхан",
          "Зүүнговь",
          "Зүүнхангай",
          "Малчин",
          "Наранбулаг",
          "Өлгий",
          "Өмнөговь",
          "Өндөрхангай",
          "Сагил",
          "Тариалан",
          "Түргэн",
          "Тэс",
          "Ховд",
          "Хяргас",
          "Цагаанхайрхан",
        ],
      },
      //hovd
      {
        aimag: "66cd22537025aeb24b021b76",
        sum: [
          "Алтай",
          "Булган",
          "Буянт",
          "Дарви",
          "Дөргөн",
          "Дуут",
          "Жаргалант",
          "Зэрэг",
          "Манхан",
          "Мөнххайрхан",
          "Мөст",
          "Мянгад",
          "Үенч",
          "Ховд",
          "Цэцэг",
          "Чандмань",
          "Эрдэнэбүрэн",
        ],
      },
      //Хөвсгөл аймаг
      {
        aimag: "66cd225c7025aeb24b021b78",
        sum: [
          "Алаг-Эрдэнэ",
          "Арбулаг",
          "Баянзүрх",
          "Бүрэнтогтох",
          "Галт",
          "Жаргалант",
          "Их-Уул",
          "Мөрөн",
          "Рашаант",
          "Рэнчинлхүмбэ",
          "Тариалан",
          "Тосонцэнгэл",
          "Төмөрбулаг",
          "Түнэл",
          "Улаан-Уул",
          "Ханх",
          "Хатгал",
          "Цагааннуур",
          "Цагаан-Уул",
          "Цагаан-Үүр",
          "Цэцэрлэг",
          "Чандмань-Өндөр",
          "Шинэ-Идэр",
          "Эрдэнэбулган",
        ],
      },
      // Хэнтий аймаг
      {
        aimag: "66cd22627025aeb24b021b7a",
        sum: [
          "Батноров",
          "Батширээт",
          "Баян-Адарга",
          "Баянмөнх",
          "Баян-Овоо",
          "Баянхутаг",
          "Биндэр",
          "Бор-Өндөр",
          "Чингис",
          "Галшар",
          "Дадал",
          "Дархан",
          "Дэлгэрхаан",
          "Жаргалтхаан",
          "Мөрөн",
          "Норовлин",
          "Өмнөдэлгэр",
          "Хэрлэн",
          "Цэнхэрмандал",
        ],
      },
    ];
    sumuud.map(async (list, index) => {
      list.sum.map(async (el) => {
        await Model.create({
          district: list.aimag,
          name: el,
        });
      });
    });
    res.status(200).json({
      success: true,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});

exports.updateModel = asyncHandler(async (req, res, next) => {
  try {
    const result = await Model.findByIdAndUpdate(req.params.id, {
      ...req.body,
    });
    res.status(200).json({
      success: true,
      data: result,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});
exports.getModel = asyncHandler(async (req, res, next) => {
  try {
    const result = await Model.findById(req.params.id);
    res.status(200).json({
      success: true,
      data: result,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});

exports.deleteModel = asyncHandler(async (req, res, next) => {
  try {
    const result = await Model.findByIdAndDelete(req.params.id);
    res.status(200).json({
      success: true,
      data: result,
    });
  } catch (error) {
    customResponse.error(res, error.message);
  }
});
